class TextNote:
    
    welcome = 'Вас приветствует приложение Заметки!'   

    main_menu = ['Главное меню',
                'Создать заметку',
                'Просмотр заметок',
                'Действия с заметками',
                'Выход']
    
    sub_menu = ['Просмотр заметок',
                'По названию',
                'По дате']
    
    edit_menu = ['Действия с заметкой: ',
                 'Редактировать',
                 'Удалить']


    main_menu_choice = 'Введите соответствующий номер: '
    
    error_num = 'Ошибка ввода, повторите ввод! '
    
    reserved_name = 'Заметка с таким именем уже существует!'

    empty_notes = 'Заметки отсутствуют '

    notes_name = 'Введите название заметки: '
    
    notes_content = 'Введите содержание заметки '
    
    notes_number = 'Для работы с заметкой введите её номер:  '
    
    del_num = 'Введите < 1 >, чтобы удалить, ENTER оставить её: '

    good_bay = 'До новых встреч!'